{
  "education": [
    {
      "awards_achievements": [
        "GPA: 8.05/10"
      ],
      "degree": "Bachelor of Technology",
      "department": "Computer Science and Engineering",
      "duration": "2017-2021",
      "school_name": "VIT University, Vellore, India"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-d14mittal",
  "highlighted_projects": [
    {
      "description": "Built a Back-end Micro-services Architecture retrieving a user's movie rating and movie info via API into consolidated data. Implemented service discovery and Microservice registry using Eureka for service registry and load balancers.",
      "git_url": "https://github.com/d14mittal/Movie-Ratings-Microservice-Application",
      "name": "Movie Catalog System with Microservices"
    },
    {
      "description": "Developed a Full-Stack Application maintaining the record of employees in a particular company. The projects aims to Store vital information of an employee in a MySQL Database and allowing the user to interact with a User Interface built using React.js. The backend services/REST API have been handled using the Spring boot and Spring Data JPA framework.",
      "git_url": "https://github.com/d14mittal/Employee-Management-System",
      "name": "Employee Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Built a Linux Cluster Monitoring Application used for collecting and monitoring the hardware-related data of virtual machines. Implemented the application with Bash Scripts, PostgreSQL and Docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Dhruv Mittal",
  "others": [
    {
      "bullets": [
        "Coursera - Software Development Processes and Methodologies",
        "Udemy - Microservices with gRPC [Java + Spring Boot + Protobuf]",
        "Coursera - Databases and SQL for Data Science"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Secured a 4-star rating on the Hackerrank platform for solving Database Management problems with SQL queries",
        "Earned Data Structure I, 50 Days Challenge Badge and solved 130+ problems on the LeetCode with Algorithms in Java"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Outdoors - Gym, Badminton",
        "Socializing and Networking",
        "Movies, TV Shows, Sci-Fi/Thriller/Action"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Built a Linux Cluster Monitoring Application used for collecting and monitoring the hardware-related data of virtual machines. Implemented the application with Bash Scripts, PostgreSQL and Docker. Automated the process of collecting the hardware data and inserting into database with bash scripting. Automated the collection of live hardware usage data into the database with the help of crontab configuration which runs the script every minute.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Technowiz IT Services",
      "description": "Built an E-commerce App with 35% annual revenue growth following Agile development methodologies / Scrum processes. Developed highly scalable environment using Spring Cloud and AWS Lambda serverless reducing company expenses by 33%. Reduced 80% of bugs by troubleshooting, debugging, and designing efficient, reusable, and reliable code for performance.",
      "duration": "2022-2023",
      "title": "Software Developer"
    },
    {
      "company": "Wipro Limited",
      "description": "Delivered 5 Java Applications using gRPC for APM tools like AWS CloudWatch, Prometheus, Nagios XI, Splunk, and Zabbix. Data-driven decisions led 40% performance increment in the Zabbix application by implementing concurrency in the REST APIs. Achieved 90% code coverage in unit test and integration test of API services/functionalities in the Docker environment",
      "duration": "2021-2022",
      "title": "Software Developer"
    },
    {
      "company": "Neiv Technology Private Limited ",
      "description": "Facilitated the development of a front-end user interface by demonstrating proficiency in HTML, CSS, and JavaScript. Attained responsive web designs, SEO and cross-platform compatibility for all types of mobile, tablet and desktop devices",
      "duration": "2020-2020",
      "title": "Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "Python",
      "gRPC framework",
      "Maven build tool",
      "Web Services - REST APIs",
      "Microservices and Distributed Systems",
      "MongoDB",
      "AWS"
    ],
    "familiar": [
      "High Level Designing and Software Architecture",
      "React.js",
      "Typescript",
      "Jenkins",
      "Kubernetes"
    ],
    "proficient": [
      "Java",
      "Spring Boot",
      "Linux/Bash",
      "MySQL/SQL",
      "Agile/Scrum",
      "Git",
      "HTML",
      "CSS",
      "Data Structures and Algorithms"
    ]
  },
  "summary": "Software Developer with 2+ years of work experience leveraging industry experience in Web Application and Software Development, delivering complex application systems and converting business requirements into technical solutions. I have a Bachelors Degree in Computer Science where I have covered fundamentals and advanced topics such as Data Structures, Database Management, Distributed Computing, Operating Systems, Algorithms and more. The software industry is powerful as it can solve real-world problems and challenges which makes me passionate about technology, innovation and creation."
}
