{
  "education": [
    {
      "awards_achievements": [
        "GPA: 8.05/10"
      ],
      "degree": "Bachelor of Technology",
      "department": "Computer Science and Engineering",
      "duration": "2017-2021",
      "school_name": "VIT University, Vellore, India"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-d14mittal",
  "highlighted_projects": [
    {
      "description": "Built a back-end microservices architecture with Spring boot fetching the movie-ratings and movie-info from different microservices stored in the internal Collection Framework List via API into consolidated data. Implemented service discovery and microservice registry using Eureka for service registry and load balancing.",
      "git_url": "https://github.com/d14mittal/Movie-Ratings-Microservice-Application",
      "name": "Movie Catalog System with Microservices"
    },
    {
      "description": "Developed a full-Stack application maintaining the record of employees in a company with backend services using Spring boot and Spring Data JPA. The project aims to store vital information of an employee in a MySQL database and allow the user to interact with a user interface built using React.js.#List of professional experience",
      "git_url": "https://github.com/d14mittal/Employee-Management-System",
      "name": "Employee Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Built a Linux Cluster Monitoring Application used for collecting and monitoring the hardware-related data of virtual machines. Implemented the application with Bash Scripts, PostgreSQL and Docker Technologies. We created a docker container using the psql_docker.sh running Postgre:Alpine-9.6 and provisioned a PSQL instance CLI in our system. The ddl.sql script is responsible for connecting to the host_agent, creating the host_info and host_usage tables. The host_info.sh and host_usage.sh are fetching the hardware specs and real-time data with bash scripting and inserting data into the database tables. Configured the crontab as well to capture real-time data every minute.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "The main objective of this project is to efficiently analyze and evaluate the usage and demand of the club's facilities using the provided dataset. To achieve this, we will be using PostgreSQL, a widely-used and powerful relational database management system. This project focuses on a recently established country club and its comprehensive dataset. Throughout the project, we will explore various SQL queries and statements to extract valuable insights from the dataset. Tasks such as adding new facilities, correcting data entry errors, retrieving specific information, and generating informative reports will be performed. By leveraging SQL and our understanding of the dataset, we uncover valuable insights into facility usage patterns and member behaviour.",
      "git_url": "/sql",
      "name": "SQL Project"
    },
    {
      "description": "The primary objective was to develop a robust JDBC application that allows users to perform CRUD operations on the database, leveraging the powerful JDBC API. It incorporates a PostgreSQL database within a Docker container setting, employing Maven as the tool for managing packages and resolving dependencies, and opting for Git as the designated version control system.",
      "git_url": "/core_java/jdbc",
      "name": "JDBC App"
    },
    {
      "description": "The Grep app project has been designed to match the Regular Expression pattern from a file and write all the matches to an output file. The project has been implemented using Core Java and Slf4h-log4j dependency for logging purposes. All the dependencies and project build management is handled by Maven build tool. The Grep application can be dockerized with Dockerfile and could easily run on any platform for distribution and deployment.",
      "git_url": "/core_java/grep",
      "name": "Grep App"
    },
    {
      "description": "Integrate a trading platform with a REST API that front-end applications can consume, enabling users to manage client profiles and accounts, monitor portfolio performance, and execute securities trades efficiently. Utilize Java 8 and Spring Boot for the implementation of the REST API, encompassing the platform's core business logic, such as managing trader profiles, executing security orders, and monitoring portfolio performance. Ensure data persistence with a PostgreSQL database. Acquire market data from IEX Cloud, a service that provides free access to market data through its REST API, and incorporate it into the Spring Boot application.",
      "git_url": "/springboot",
      "name": "Springboot Trading App"
    }
  ],
  "name": "Dhruv Mittal",
  "others": [
    {
      "bullets": [
        "Coursera - Software Development Processes and Methodologies",
        "Udemy - Microservices with gRPC [Java + Spring Boot + Protobuf]",
        "Coursera - Databases and SQL for Data Science"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Secured a 4-star rating on the Hackerrank platform for solving Database Management problems with SQL queries",
        "Earned Data Structure I, 50 Days Challenge Badge and solved 130+ problems on the LeetCode with Algorithms in Java"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Volunteered at Habitat for Humanity Non-Profit Organization for environmental causes by participating in reuse and recycle activities and quality assurance.",
        "Participated in Event Management activities at VIT University for the Annual Fest Concert Event and Merchandise distribution. "
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Facilitated development of a full-stack application using technologies like React.js, Spring boot, REST API, Microservices, PostgreSQL, following the best Design-patterns and SDLC methodologies. Contributed to application deployment on Cloud and worked on DevOps Operations for Continuous Integration and Delivery. Extensively worked with the team and the tech lead to solve the challenges and derive technical solutions.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Technowiz IT Services",
      "description": "Developed an E-commerce application with a highly scalable environment using Spring Cloud and AWS Lambda serverless reducing company expenses by 33%. Built a frontend interface with technologies like HTML, CSS and React.js library. Reduced 80% of bugs by troubleshooting, debugging, and designing efficient, reusable, and reliable code for performance.",
      "duration": "2022-2023",
      "title": "Software Developer"
    },
    {
      "company": "Wipro Limited",
      "description": "Delivered 5 Java Applications using gRPC for APM tools like AWS CloudWatch, Prometheus, Nagios XI, Splunk, and Zabbix. Data-driven decisions led 40% performance increment in the Zabbix application by implementing concurrency in the REST APIs. Achieved 90% code coverage in unit test and integration test of API services/functionalities in the Docker environment.",
      "duration": "2021-2022",
      "title": "Software Developer"
    },
    {
      "company": "Neiv Technology Private Limited ",
      "description": "Facilitated the development of a front-end user interface by demonstrating proficiency in HTML, CSS, and JavaScript. Attained responsive web designs, SEO and cross-platform compatibility for all types of mobile, tablet and desktop devices.",
      "duration": "2020-2020",
      "title": "Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "Angular",
      "React.js",
      "Node.js/Express",
      "TypeScript",
      "Python",
      "Jest and Cypress",
      "MongoDB",
      "AWS"
    ],
    "familiar": [
      "System Design",
      "Jenkins",
      "Kubernetes",
      "CI/CD",
      "RxJava"
    ],
    "proficient": [
      "Java",
      "Spring Framework",
      "Linux/Bash",
      "MySQL/SQL",
      "Docker",
      "Agile/Scrum",
      "HTML",
      "CSS"
    ]
  },
  "summary": "I'm a Software Developer leveraging 2+ years of work experience in Web Application and Software Development, delivering complex application systems and converting business requirements into technical solutions. I have a Bachelors Degree in Computer Science where I have covered fundamentals and advanced topics such as Data Structures, Database Management, Distributed Computing, Operating Systems, Algorithms and more. I have prominent experience working with Java, Spring boot, gRPC framework, Docker, Linux, JavaScript, Angular, Node.js, React and Express and contributed to Application Performance Monitoring and Ecommerce projects. The software industry is powerful as it can solve real-world problems and challenges which makes me passionate about technology, innovation and creation."
}
